# NullParameterValue Class

---
A class that represent an empty (null) value of a parameter element.
SystemObject Autodesk.Revit.DBParameterValue Autodesk.Revit.DBNullParameterValue
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class NullParameterValue : ParameterValue

    Public Class NullParameterValue
    	Inherits ParameterValue

    public ref class NullParameterValue : public ParameterValue

    type NullParameterValue =
        class
            inherit ParameterValue
        end
The NullParameterValue type exposes the following members.
| Name| Description
---|---|---
| NullParameterValue|  Default constructor
Top
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity. (Inherited from ParameterValue)
Top
| Name| Description
---|---|---
| Copy|  Makes an identical copy of the given parameter value. (Inherited from ParameterValue)
| Dispose| (Inherited from ParameterValue)
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| IsEqual|  Tests equality with another instance of the same class. (Inherited from ParameterValue)
| IsSameType|  Tests another instance is of the same value type. (Inherited from ParameterValue)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.DB Namespace